# ------------------------------------------
# Задача 1. Обчислення степеня числа
# ------------------------------------------
# Напишіть рекурсивну функцію power(a, b),
# яка обчислює значення a^b (a в степені b).
# Не використовуйте оператор ** або функцію pow().

# Приклад:
# print(power(2, 5)) → 32
def power(a, b):
    if b == 0:
        return 1
    else:
        return a * power(a, b - 1)
print(power(2, 3))

# ------------------------------------------
# Задача 2. Сума елементів списку
# ------------------------------------------
# Створіть рекурсивну функцію list_sum(lst),
# яка знаходить суму всіх чисел у списку.

# Приклад:
# print(list_sum([2, 4, 6, 8])) → 20
def list_sum(lst):
    if len(lst) == 0:
        return 0
    else:
        return lst[0] + list_sum(lst[1:])
print(list_sum([2, 4, 6, 8]))

# ------------------------------------------
# Задача 3. Рекурсивний зворотний відлік
# ------------------------------------------
# Напишіть функцію countdown(n),
# яка виводить числа від n до 1,
# а потім повідомлення "Старт!".

# Приклад:
# countdown(5)
# Вивід:
# 5
# 4
# 3
# 2
# 1
# Старт!

def countdown(n):
    if n <= 0:
        print("Старт!")
    else:
        print(n)
        countdown(n - 1)
print(countdown(16))

